package com.qiuqiuqiu.weatherPredicate.model

data class CityWeather(
    val id: String,
    val name: String,
    val lat: Double,
    val lon: Double,
    val icon: String,  // 和风天气 icon code
    val text: String   // 天气描述

)

data class CityInfo(
    val name: String,
    val id: String,  // QWeather 的 locationId
    val lat: Double,
    val lon: Double
)

val provinceCapitals = listOf(
    CityInfo("北京", "101010100", 39.9042, 116.4074),
    CityInfo("天津", "101030100", 39.3434, 117.3616),
    CityInfo("上海", "101020100", 31.2304, 121.4737),
    CityInfo("重庆", "101040100", 29.4316, 106.9123),
    CityInfo("石家庄", "101090101", 38.0428, 114.5149),
    CityInfo("太原", "101100101", 37.8706, 112.5489),
    CityInfo("呼和浩特", "101080101", 40.817, 111.7652),
    CityInfo("沈阳", "101070101", 41.8057, 123.4315),
    CityInfo("长春", "101060101", 43.816, 125.3235),
    CityInfo("哈尔滨", "101050101", 45.8038, 126.5349),
    CityInfo("南京", "101190101", 32.0617, 118.7778),
    CityInfo("杭州", "101210101", 30.245, 120.2039),
    CityInfo("合肥", "101220101", 31.8612, 117.2858),
    CityInfo("福州", "101230101", 26.0614, 119.3062),
    CityInfo("南昌", "101240101", 28.6829, 115.8582),
    CityInfo("济南", "101120101", 36.6502, 117.1201),
    CityInfo("郑州", "101180101", 34.7473, 113.6248),
    CityInfo("武汉", "101200101", 30.5931, 114.3054),
    CityInfo("长沙", "101250101", 28.2282, 112.9388),
    CityInfo("广州", "101280101", 23.1252, 113.2806),
    CityInfo("南宁", "101300101", 22.817, 108.3669),
    CityInfo("海口", "101310101", 20.044, 110.1999),
    CityInfo("成都", "101270101", 30.6594, 104.0657),
    CityInfo("贵阳", "101260101", 26.5783, 106.7135),
    CityInfo("昆明", "101290101", 24.8797, 102.8332),
    CityInfo("拉萨", "101140101", 29.652, 91.1721),
    CityInfo("西安", "101110101", 34.3416, 108.9398),
    CityInfo("兰州", "101160101", 36.0611, 103.8343),
    CityInfo("西宁", "101150101", 36.6171, 101.7779),
    CityInfo("银川", "101170101", 38.4872, 106.2309),
    CityInfo("乌鲁木齐", "101130101", 43.8256, 87.6169),
    CityInfo("台北", "101340101", 25.033, 121.5654),
    CityInfo("香港", "101320101", 22.3964, 114.1095),
    CityInfo("澳门", "101330101", 22.203, 113.545)
)